Revit 2026 API

# CompoundStructureSetMaterialId Method

---

Sets a material element for a specified layer.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetMaterialId(
	int layerIdx,
	ElementId materialId
)
```
```vb
Public Sub SetMaterialId (
	layerIdx As Integer,
	materialId As ElementId
)
```
```cpp
public:
void SetMaterialId(
	int layerIdx,
	ElementId^ materialId
)
```
```fsharp
member SetMaterialId :
        layerIdx : int *
        materialId : ElementId -> unit
```

#### Parameters

layerIdx Int32
     Index of a layer in the CompoundStructure. The layer index is zero based. It counts from the exterior of wall and from the top of roofs, floors and ceilings.
materialId ElementId
     The ElementId of a Material element.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |
| ArgumentOutOfRangeException | The layer index is out of range. |

It is not verified that materialId corresponds to a valid Material element.

#### Reference

CompoundStructure Class

Autodesk.Revit.DB Namespace